#### NumericRevisionSettings Members

---

|  |
| --- |
| NumericRevisionSettings Class   Constructors   Methods   Properties   See Also |

The  NumericRevisionSettings  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | NumericRevisionSettings | Constructs a NumericRevisionSettings with a simple, default numbering sequence. |
| Public method | NumericRevisionSettings(NumericRevisionSettings) | Constructs a new copy of the input NumericRevisionSettings object. |
| Public method | NumericRevisionSettings(Int32, String, String) | Constructs a NumericRevisionSettings object. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  NumericRevisionSettings |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | IsEqual | Determines whether a specified NumericRevisionSettings is the same as 'this'. |
| Public method | IsValid | Determines whether the NumericRevisionSettings object is in a valid state. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | MinimumDigits | Controls the minimum number of digits for a revision number. |
| Public property | Prefix | The prefix string that will be prepended to the number of each revision with Numeric RevisionNumberingType. |
| Public property | StartNumber | The start number for the sequence. |
| Public property | Suffix | The suffix string that will be appended to the number of each revision with Numeric RevisionNumberingType. |

# See Also

NumericRevisionSettings Class

Autodesk.Revit.DB Namespace